network-tests/v2/oha-results/non-colorized/istio-service-mesh-poc-pod-baseline-warm-up-2-tests/test-pod-baseline-warm-up-2-172.20.66.201-32.txt
Started at 2024-03-29-10-27
Summary:
  Success rate:	100.00%
  Total:	73.4760 secs
  Slowest:	0.4743 secs
  Fastest:	0.0613 secs
  Average:	0.2350 secs
  Requests/sec:	136.0989

  Total data:	47.34 MiB
  Size/request:	4.
  Size/sec:	659.78 KiB

Response time histogram:
  0.061 [1]    |
  0.103 [7]    |
  0.144 [122]  |■
  0.185 [1041] |■■■■■■■■■
  0.227 [3373] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.268 [3362] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.309 [1515] |■■■■■■■■■■■■■■
  0.350 [397]  |■■■
  0.392 [141]  |■
  0.433 [37]   |
  0.474 [4]    |

Response time distribution:
  10.00% in 0.1817 secs
  25.00% in 0.2056 secs
  50.00% in 0.2308 secs
  75.00% in 0.2608 secs
  90.00% in 0.2931 secs
  95.00% in 0.3140 secs
  99.00% in 0.3660 secs
  99.90% in 0.4208 secs
  99.99% in 0.4603 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 0.0002 secs, 0.0148 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200] 10000 responses
Finished at 2024-03-29-10-28